Revit 2027 API
BuiltInFailures.DPartFailures.DivideVolumesProfilesGapForWidthSome Property
 Division family cannot be used with the selected division gap for some widths of hosts
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DivideVolumesProfilesGapForWidthSome { get; }
Public Shared ReadOnly Property DivideVolumesProfilesGapForWidthSome As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DivideVolumesProfilesGapForWidthSome {
	FailureDefinitionId^ get ();
}
static member DivideVolumesProfilesGapForWidthSome : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace